## Terraform Plan — `staging`
<details><summary>Show Plan</summary>

```hcl
module.networking.data.aws_availability_zones.available: Reading...
module.networking.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.alb.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "franchise-api-staging-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-alb"
          + "Project"     = "franchise-api"
        }
      + tags_all                                                     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-alb"
          + "Project"     = "franchise-api"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.alb.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_target_group.app will be created
  + resource "aws_lb_target_group" "app" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "franchise-api-staging-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-tg"
          + "Project"     = "franchise-api"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-tg"
          + "Project"     = "franchise-api"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/actuator/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 3
        }
    }

  # module.dynamodb.aws_dynamodb_table.branches will be created
  + resource "aws_dynamodb_table" "branches" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "franchise-api-staging-branches"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-branches"
          + "Project"     = "franchise-api"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-branches"
          + "Project"     = "franchise-api"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "franchiseId"
          + type = "S"
        }
      + attribute {
          + name = "id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "franchiseId"
          + name               = "franchiseId-index"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }
    }

  # module.dynamodb.aws_dynamodb_table.franchises will be created
  + resource "aws_dynamodb_table" "franchises" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "franchise-api-staging-franchises"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-franchises"
          + "Project"     = "franchise-api"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-franchises"
          + "Project"     = "franchise-api"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }
    }

  # module.dynamodb.aws_dynamodb_table.products will be created
  + resource "aws_dynamodb_table" "products" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "franchise-api-staging-products"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-products"
          + "Project"     = "franchise-api"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-products"
          + "Project"     = "franchise-api"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "branchId"
          + type = "S"
        }
      + attribute {
          + name = "id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "branchId"
          + name               = "branchId-index"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }
    }

  # module.ecr.aws_ecr_lifecycle_policy.app will be created
  + resource "aws_ecr_lifecycle_policy" "app" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "franchise-api-staging"
    }

  # module.ecr.aws_ecr_repository.app will be created
  + resource "aws_ecr_repository" "app" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "franchise-api-staging"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging"
          + "Project"     = "franchise-api"
        }
      + tags_all             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging"
          + "Project"     = "franchise-api"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecs.aws_cloudwatch_log_group.app will be created
  + resource "aws_cloudwatch_log_group" "app" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/franchise-api/staging"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "franchise-api"
        }
      + tags_all          = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "franchise-api"
        }
    }

  # module.ecs.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "franchise-api-staging-cluster"
      + tags     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-cluster"
          + "Project"     = "franchise-api"
        }
      + tags_all = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-cluster"
          + "Project"     = "franchise-api"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs.aws_ecs_service.app will be created
  + resource "aws_ecs_service" "app" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "franchise-api-staging-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-service"
          + "Project"     = "franchise-api"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-service"
          + "Project"     = "franchise-api"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "franchise-api"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs.aws_ecs_task_definition.app will be created
  + resource "aws_ecs_task_definition" "app" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "AWS_REGION"
                          + value = "us-east-1"
                        },
                      + {
                          + name  = "DYNAMODB_TABLE_BRANCHES"
                          + value = "franchise-api-staging-branches"
                        },
                      + {
                          + name  = "DYNAMODB_TABLE_FRANCHISES"
                          + value = "franchise-api-staging-franchises"
                        },
                      + {
                          + name  = "DYNAMODB_TABLE_PRODUCTS"
                          + value = "franchise-api-staging-products"
                        },
                      + {
                          + name  = "SPRING_PROFILES_ACTIVE"
                          + value = "staging"
                        },
                    ]
                  + essential        = true
                  + image            = "placeholder"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/franchise-api/staging"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + name             = "franchise-api"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "franchise-api-staging"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-task"
          + "Project"     = "franchise-api"
        }
      + tags_all                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-task"
          + "Project"     = "franchise-api"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.iam.aws_iam_role.task_execution_role will be created
  + resource "aws_iam_role" "task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "ECS task execution role for franchise-api in staging"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "franchise-api-staging-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "franchise-api"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "franchise-api"
        }
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role.task_role will be created
  + resource "aws_iam_role" "task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role assumed by the franchise-api application container in staging"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "franchise-api-staging-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "franchise-api"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "franchise-api"
        }
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role_policy.dynamodb_access will be created
  + resource "aws_iam_role_policy" "dynamodb_access" {
      + id          = (known after apply)
      + name        = "dynamodb-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.ecs_execution_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_execution_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "franchise-api-staging-task-execution-role"
    }

  # module.networking.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-igw"
          + "Project"     = "franchise-api"
        }
      + tags_all = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-igw"
          + "Project"     = "franchise-api"
        }
      + vpc_id   = (known after apply)
    }

  # module.networking.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-public-rt"
          + "Project"     = "franchise-api"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-public-rt"
          + "Project"     = "franchise-api"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Allow inbound HTTP to the ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP from internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "franchise-api-staging-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-alb-sg"
          + "Project"     = "franchise-api"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-alb-sg"
          + "Project"     = "franchise-api"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "Allow inbound port 8080 from the ALB only"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound (DynamoDB API calls)"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "App port from ALB"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "franchise-api-staging-ecs-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-ecs-sg"
          + "Project"     = "franchise-api"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-ecs-sg"
          + "Project"     = "franchise-api"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-public-subnet-1"
          + "Project"     = "franchise-api"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-public-subnet-1"
          + "Project"     = "franchise-api"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-public-subnet-2"
          + "Project"     = "franchise-api"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-public-subnet-2"
          + "Project"     = "franchise-api"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-vpc"
          + "Project"     = "franchise-api"
        }
      + tags_all                             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "franchise-api-staging-vpc"
          + "Project"     = "franchise-api"
        }
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns_name                   = (known after apply)
  + cloudwatch_log_group           = "/ecs/franchise-api/staging"
  + dynamodb_branches_table_name   = "franchise-api-staging-branches"
  + dynamodb_franchises_table_name = "franchise-api-staging-franchises"
  + dynamodb_products_table_name   = "franchise-api-staging-products"
  + ecr_repository_url             = (known after apply)
  + ecs_cluster_name               = "franchise-api-staging-cluster"
  + ecs_service_name               = "franchise-api-staging-service"
  + ecs_task_execution_role_arn    = (known after apply)
  + ecs_task_role_arn              = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
</details>